app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."state" = ?  [["user_id", 1], ["state", "en_début"]]
---
  def index
    @to_do = current_user.tasks.where(state: "en_début")

INSERT INTO "tasks" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Certificat Medicale"], ["user_id", 1], ["created_at", "2015-05-25 07:43:03.195049"], ["updated_at", "2015-05-25 07:43:03.195049"]]
---
  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "en_exécution"], ["updated_at", "2015-05-25 20:00:27.364519"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "en_exécution"], ["updated_at", "2015-05-25 11:10:12.279467"], ["id", 10]]
---
  def change
    @task.update_attributes(state: params[:state])